app/controllers/code_major_controller.rb

SELECT * FROM "code_majors"
---
        def genres
          case_search = ''
          if !params[:query].nil?
            case_search = "major like '%#{params[:query]}%'"
          end
          records = CodeMajor.find(:all,:conditions =>case_search)
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {