app/controllers/code_trade_controller.rb

  def genres
    case_search = ''
    if !params[:query].nil?
      case_search = "codetrade::varchar like '%#{params[:query]}%' or trade like '%#{params[:query]}%'"
      end
      records = CodeTrade.find(:all,:conditions =>case_search)
      return_data = Hash.new()
      return_data[:success] = true
      return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_trades"