app/controllers/code_epngroup_controller.rb

SELECT count(*) AS count_all FROM "code_epngroups"
SELECT * FROM "code_epngroups" ORDER BY gcode LIMIT 20 OFFSET 0
---
        def read
                limit = params[:limit]
                start = params[:start]
                search = Array.new
                case_search = ""
                if !(params[:query].nil?)
                        #if !(params[:fields].nil?) and !(params[:query].nil?) and params[:query] != "" and params[:fields] != ""
                        allfields = ActiveSupport::JSON.decode(params[:fields]).join('::varchar||') + "::varchar"
                        case_search = allfields + " LIKE '%" + params[:query] + "%'"
                end
                rs = CodeEpngroup.find(:all, :conditions => case_search, :limit => limit, :offset => start, :order => "gcode")
                return_data = Hash.new()
                return_data[:totalCount] = CodeEpngroup.count(:all , :conditions => case_search)
                return_data[:records]   = rs.collect{|u| {