app/controllers/code_grouplevel_controller.rb

SELECT * FROM "code_grouplevels"
---
        def genres
          case_search = ''
          if !params[:query].nil?
            case_search = "cname like '%#{params[:query]}%'"
          end
          records = CodeGrouplevel.find(:all,:conditions =>case_search)
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {