app/controllers/code_j18status_controller.rb

SELECT * FROM "code_j18statuses" WHERE (j18code::varchar like '%%' or j18status like '%%')
SELECT * FROM "code_j18statuses"
---
  def genres
    case_search = ''
    if !params[:query].nil?
      case_search = "j18code::varchar like '%#{params[:query]}%' or j18status like '%#{params[:query]}%'"
      end
      records = CodeJ18status.find(:all,:conditions =>case_search)
      return_data = Hash.new()
      return_data[:success] = true
      return_data[:records]   = records.collect{|u| {