app/controllers/code_abtype_controller.rb

       def genres
        case_search = ''
          if !params[:query].nil?
            case_search = "abtype like '%#{params[:query]}%'"
          end
          records = CodeAbtype.find(:all,:conditions =>case_search)
---
SELECT * FROM "code_abtypes" WHERE (abtype like '%%')