app/controllers/code_prefix_controller.rb

SELECT * FROM "code_prefixes" ORDER BY id
---
        def genres
          records = CodePrefix.find(:all, :order => "id")
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {