app/controllers/code_qualify_controller.rb

SELECT * FROM "code_qualifies"
---
        def genres
          case_search = ''
          if !params[:query].nil?
            case_search = "qualify like '%#{params[:query]}%'"
          end
          records = CodeQualify.find(:all,:conditions =>case_search)
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {