app/controllers/code_marital_controller.rb

SELECT count(*) AS count_all FROM "code_maritals"
SELECT * FROM "code_maritals" ORDER BY mrcode LIMIT 20 OFFSET 0
---
        def read
                limit = params[:limit]
                start = params[:start]
                search = Array.new
                case_search = ""
                if !(params[:query].nil?)
                        #if !(params[:fields].nil?) and !(params[:query].nil?) and params[:query] != "" and params[:fields] != ""
                        allfields = ActiveSupport::JSON.decode(params[:fields]).join('::varchar||') + "::varchar"
                        case_search = allfields + " LIKE '%" + params[:query] + "%'"
                end
                rs = CodeMarital.find(:all, :conditions => case_search, :limit => limit, :offset => start, :order => "mrcode")
                return_data = Hash.new()
                return_data[:totalCount] = CodeMarital.count(:all , :conditions => case_search)
                return_data[:records]   = rs.collect{|u| {

SELECT * FROM "code_maritals" ORDER BY id
---
        def genres
          records = CodeMarital.find(:all, :order => "id")
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {