app/controllers/code_relig_controller.rb

        def genres
          records = CodeRelig.find(:all, :order => "id")
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_religs" ORDER BY id