app/controllers/code_country_controller.rb

  def read
    limit			= params[:limit]
    start			= params[:start]
    search			= Array.new
    case_search     = ""
    if !(params[:fields].nil?) and !(params[:query].nil?) and params[:query] != "" and params[:fields] != ""
      allfields = ActiveSupport::JSON.decode(params[:fields]).join('::varchar||') + "::varchar"
      case_search = allfields + " LIKE '%" + params[:query] + "%'"
    end
    rs = CodeCountry.find(:all ,:conditions => case_search, :limit => limit, :offset => start, :order => "cocode")
    return_data 		        = Hash.new()
    return_data[:totalCount] 	= CodeCountry.count(:all ,:conditions => case_search)
    return_data[:records] 	= rs.collect{|u| {
---
SELECT count(*) AS count_all FROM "code_countries"
SELECT * FROM "code_countries" ORDER BY cocode LIMIT 20 OFFSET 0

  def genres
    case_search = ''
    if !params[:query].nil?
      case_search = "coname like '%#{params[:query]}%'"
    end
    records = CodeCountry.find(:all,:conditions =>case_search)
    return_data = Hash.new()
    return_data[:success] = true
    return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_countries"