app/controllers/code_province_controller.rb

SELECT * FROM "code_provinces" ORDER BY provname
---
  def genres
      case_search = ''
      if !params[:query].nil?
        case_search = "provname like '%#{params[:query]}%'"
      end
      records = CodeProvince.find(:all,:conditions =>case_search, :order => "provname")
      return_data = Hash.new()
      return_data[:success] = true
      return_data[:records]   = records.collect{|u| {