app/controllers/code_executive_controller.rb

        def read
                limit = params[:limit]
                start = params[:start]
                search = Array.new
                case_search = ""
                if !(params[:query].nil?)
                        #if !(params[:fields].nil?) and !(params[:query].nil?) and params[:query] != "" and params[:fields] != ""
                        allfields = ActiveSupport::JSON.decode(params[:fields]).join('::varchar||') + "::varchar"
                        case_search = allfields + " LIKE '%" + params[:query] + "%'"
                end
                rs = CodeExecutive.find(:all, :conditions => case_search, :limit => limit, :offset => start, :order => "excode")
                return_data = Hash.new()
                return_data[:totalCount] = CodeExecutive.count(:all , :conditions => case_search)
                return_data[:records]   = rs.collect{|u| {
---
SELECT count(*) AS count_all FROM "code_executives"
SELECT * FROM "code_executives" ORDER BY excode LIMIT 20 OFFSET 0

        def genres
          case_search = ''
          if !params[:query].nil?
            case_search = "exname like '%#{params[:query]}%'"
          end
          records = CodeExecutive.find(:all,:conditions =>case_search)
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_executives"