app/controllers/code_punish_controller.rb

SELECT * FROM "code_punishes" WHERE (punname like '%%')
---
        def genres
          case_search = ''
          if !params[:query].nil?
            case_search = "punname like '%#{params[:query]}%'"
          end
          records = CodePunish.find(:all,:conditions =>case_search)