app/controllers/code_job_controller.rb

SELECT count(*) AS count_all FROM "code_jobs"
SELECT * FROM "code_jobs" ORDER BY jobcode LIMIT 10 OFFSET 0
---
        def read
                limit = params[:limit]
                start = params[:start]
                search = Array.new
                case_search = ""
                if !(params[:query].nil?)
                        #if !(params[:fields].nil?) and !(params[:query].nil?) and params[:query] != "" and params[:fields] != ""
                        allfields = ActiveSupport::JSON.decode(params[:fields]).join('::varchar||') + "::varchar"
                        case_search = allfields + " LIKE '%" + params[:query] + "%'"
                end
                rs = CodeJob.find(:all, :conditions => case_search, :limit => limit, :offset => start, :order => "jobcode")
                return_data = Hash.new()
                return_data[:totalCount] = CodeJob.count(:all , :conditions => case_search)
                return_data[:records]   = rs.collect{|u| {

SELECT * FROM "code_jobs"
---
  def genres
    case_search = ''
    if !params[:query].nil?
      case_search = "jobcode::varchar like '%#{params[:query]}%' or jobname like '%#{params[:query]}%'"
      end
      records = CodeJob.find(:all,:conditions =>case_search)
      return_data = Hash.new()
      return_data[:success] = true
      return_data[:records]   = records.collect{|u| {