app/controllers/code_position_controller.rb

        def read
                limit = params[:limit]
                start = params[:start]
                search = Array.new
                case_search = ""
                if !(params[:query].nil?)
                        #if !(params[:fields].nil?) and !(params[:query].nil?) and params[:query] != "" and params[:fields] != ""
                        allfields = ActiveSupport::JSON.decode(params[:fields]).join('::varchar||') + "::varchar"
                        case_search = allfields + " LIKE '%" + params[:query] + "%'"
                end
                rs = CodePosition.find(:all, :conditions => case_search, :limit => limit, :offset => start, :order => "poscode")
                return_data = Hash.new()
                return_data[:totalCount] = CodePosition.count(:all , :conditions => case_search)
                return_data[:records]   = rs.collect{|u| {
---
SELECT * FROM "code_positions" WHERE (poscode::varchar||shortpre::varchar||longpre::varchar||posname::varchar LIKE '%6010%') ORDER BY poscode LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "code_positions" WHERE (poscode::varchar||shortpre::varchar||longpre::varchar||posname::varchar LIKE '%6010%')
SELECT * FROM "code_positions" ORDER BY poscode LIMIT 20 OFFSET 0

        def genres
          case_search = ''
          if !params[:query].nil?
            case_search = "posname like '%#{params[:query]}%'"
          end
          records = CodePosition.find(:all,:conditions =>case_search)
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_positions"