app/controllers/code_update_controller.rb

  def genres
    case_search = ''
    if !params[:query].nil?
      case_search = "updname like '%#{params[:query]}%'"
    end
    records = CodeUpdate.find(:all,:conditions =>case_search)
    return_data = Hash.new()
    return_data[:success] = true
    return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_updates"