app/controllers/code_edulevel_controller.rb

                def genres
        case_search = ''
          if !params[:query].nil?
            case_search = "edulevel like '%#{params[:query]}%'"
          end
          records = CodeEdulevel.find(:all,:conditions =>case_search)
          return_data = Hash.new()
          return_data[:success] = true
          return_data[:records]   = records.collect{|u| {
---
SELECT * FROM "code_edulevels"