app/controllers/data_pis_punish_controller.rb

  def add
    rs = PisPunish.new(
      :pis_personel_id        => params[:pis_personel_id],
      :forcedate              => to_date_i( params[:forcedate] ) ,
      :puncode                => params[:puncode],
      :description            => params[:description],
      :cmdno                  => params[:cmdno]
    )
    if rs.save
---
INSERT INTO "pis_punishes" ("puncode", "updated_at", "pis_personel_id", "cmdno", "upd_user", "description", "forcedate", "created_at") VALUES(3, '2010-09-17 16:40:07.099000', E'#388', E'กฟหกฟ', NULL, E'หฟกฟห', NULL, '2010-09-17 16:40:07.099000') RETURNING "id"

  def search_id
    rs = PisPunish.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
---
SELECT * FROM "pis_punishes" WHERE (pis_personel_id = '#388') LIMIT 1