app/controllers/data_pisposhis_controller.rb

  def search_edit
    rs = PisPoshis.find(:all,:conditions => "id = #{params[:id]}")
    return_data = Hash.new()
    return_data[:data]    = rs.collect{|u| {
      :id                => u.id,
      :historder         => u.historder,
      :refcmnd            => u.refcmnd,
      :updcode            => u.updcode,
      :forcedate          => u.forcedate,
      :posid              => u.posid,
      :poscode            => u.poscode,
      :excode             => u.excode,
      :ptcode             => u.ptcode,
      :salary             => u.salary,
      :c                  => u.c,
      :epcode             => u.epcode,
      :mincode            => u.mincode,
      :deptcode           => u.deptcode,
      :divcode            => u.divcode,
      :sdcode             => u.sdcode,
      :sdname             => (u.sdcode.nil?)? nil:( CodeSdept.find_by_sdcode(  u.sdcode  ).nil? )? nil:CodeSdept.find_by_sdcode(  u.sdcode  ).sdname,
      :subdcode           => u.subdcode,
      :sectcode           => u.sectcode,
      :jobcode            => u.jobcode,
      :note               => u.note
---
SELECT * FROM "pis_poshis" WHERE (id = 4340)
SELECT * FROM "code_sdepts" WHERE ("code_sdepts"."sdcode" = 3200) LIMIT 1

  def search_id
    rs = PisPoshis.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
---
SELECT * FROM "pis_poshis" WHERE (pis_personel_id = '#388') LIMIT 1