app/controllers/data_pis_absent_controller.rb

  def add
    rs = PisAbsent.new(
        :pis_personel_id       => params[:pis_personel_id],
        :abcode                => params[:abcode],
        :begindate             => to_date_i(params[:begindate]),
        :enddate               => to_date_i(params[:enddate]),
        :amount                => params[:amount],
        :flagcount             => (params[:flagcount] == "on")? "Y":"N"
    )
    if rs.save
---
INSERT INTO "pis_absents" ("updated_at", "enddate", "pis_personel_id", "begindate", "upd_user", "amount", "abcode", "flagcount", "created_at") VALUES('2010-09-17 16:09:35.183000', NULL, E'#213', NULL, NULL, NULL, NULL, E'N', '2010-09-17 16:09:35.183000') RETURNING "id"

  def genre_year_fiscal
    rs = PisAbsent.find(:first,:select => "min(begindate) as min_date",:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'" )
---
SELECT min(begindate) as min_date FROM "pis_absents" WHERE (pis_personel_id = '#213') LIMIT 1

  def search_id
    rs = PisAbsent.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
---
SELECT * FROM "pis_absents" WHERE (pis_personel_id = '#388') LIMIT 1