app/controllers/data_pis_trainning_controller.rb

  def add
    sql = "Select max(tno) as n from pis_trainnings where pis_personel_id = '#{params[:pis_personel_id]}'"
    rs_count = PisPoshis.find_by_sql(sql)

    rs = PisTrainning.new(
        :tno                    => (rs_count[0].n.to_i) +1,
        :begindate              => to_date_i(params[:begindate]),
        :pis_personel_id        => params[:pis_personel_id],
        :cocode                 => params[:cocode],
        :enddate                => to_date_i(params[:enddate]),
        :cource                 => params[:cource],
        :institute              => params[:institute]
    )
    if rs.save
---
INSERT INTO "pis_trainnings" ("updated_at", "enddate", "pis_personel_id", "cocode", "cource", "begindate", "upd_user", "tno", "institute", "created_at") VALUES('2010-09-17 16:21:26.787000', NULL, E'#388', NULL, E'ฟหกฟห', NULL, NULL, 1, E'', '2010-09-17 16:21:26.787000') RETURNING "id"

  def search_id
    rs = PisTrainning.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
---
SELECT * FROM "pis_trainnings" WHERE (pis_personel_id = '#388') LIMIT 1