app/controllers/data_pis_insig_controller.rb

  def add
    rs = PisInsig.new(
        :pis_personel_id           => params[:pis_personel_id],
        :dccode                     => params[:dccode],
        :dcyear                     => params[:dcyear],
        :book                       => params[:book],
        :section                    => params[:section],
        :pageno                     => params[:pageno],
        :seq                        => params[:seq],
        :recdate                    => to_date_i(params[:recdate]),
        :kitjadate                  => to_date_i(params[:kitjadate]),
        :retdate                    => to_date_i(params[:retdate]),
        :billno                     => params[:billno],
        :bookno                     => params[:bookno],
        :billdate                   => to_date_i(params[:billdate]),
        :money                      => params[:money],
        :poscode                    => params[:poscode],
        :excode                     => params[:excode],
        :epcode                     => params[:epcode],
        :c                          => params[:c],
        :ptcode                     => params[:ptcode],
        :note                       => params[:note]
    )
    if rs.save
---
INSERT INTO "pis_insigs" ("money", "dccode", "recdate", "poscode", "updated_at", "pis_personel_id", "billdate", "c", "retdate", "excode", "pageno", "kitjadate", "upd_user", "dcyear", "epcode", "note", "billno", "book", "section", "seq", "bookno", "ptcode", "created_at") VALUES(NULL, NULL, NULL, NULL, '2010-09-17 16:39:25.715000', E'#388', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 21312, NULL, E'', E'', NULL, E'', NULL, E'', NULL, '2010-09-17 16:39:25.715000') RETURNING "id"

  def search_id
    rs = PisInsig.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
---
SELECT * FROM "pis_insigs" WHERE (pis_personel_id = '#388') LIMIT 1