app/controllers/data_pis_change_names_controller.rb

  def edit
    rs = PisChgname.find(:all,:conditions => "chgno = #{params[:chgno]}")[0]
    rs.chgdate      = params[:chgdate]
    rs.fname        = params[:fname2]
    rs.lname        = params[:lname2]
    rs.precode      = params[:precode2]
    rs.ref          = params[:ref2]
    if rs.save
---
SELECT * FROM "pis_chgnames" WHERE (chgno = 7)
UPDATE "pis_chgnames" SET "chgdate" = '2010-11-30', "updated_at" = '2010-11-20 02:17:08.834753' WHERE "chgno" = 7