app/controllers/data_personal_controller.rb

SELECT * FROM "pis_personels" WHERE ("pis_personels"."id" = 287)
---
      def search_edit
        rs = PisPersonel.find(params[:id])

SELECT * FROM "pis_personels" WHERE (pis_personel_id = '#388') LIMIT 1
SELECT * FROM "code_prefixes" WHERE (precode = '3') LIMIT 1
---
    def search_id
      rs = PisPersonel.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
      if rs.nil?
        render :text => "{data:''}" ,:layout => false
      else
        render :text => "{data:#{rs.id},record:{data:{fname:'#{rs.fname}',lname:'#{rs.lname}',prename:'#{CodePrefix.find(:first,:conditions=>"precode = '#{rs.precode}'").prename }'        }}}" ,:layout => false