app/controllers/data_education_controller.rb

SELECT * FROM "pis_educations" WHERE ("pis_educations"."id" = 192)
---
  def search_edit
    rs = PisEducation.find(params[:id])

SELECT * FROM "pis_educations" WHERE (pis_personel_id = '#388') LIMIT 1
SELECT * FROM "pis_personels" WHERE (pis_personel_id = '#388') LIMIT 1
SELECT * FROM "code_prefixes" WHERE (precode = '3') LIMIT 1
---
  def search_id
    rs = PisEducation.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
    rs_person = PisPersonel.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
    if rs.nil?
        render :text => "{data:''}" ,:layout => false
    else
      render :text => "{data:#{rs.id},record:{data:{fname:'#{rs_person.fname}',lname:'#{rs_person.lname}',prename:'#{CodePrefix.find(:first,:conditions=>"precode = '#{rs_person.precode}'").prename }'        }}}" ,:layout => false