app/controllers/j18_controller.rb

SELECT * FROM "pis_j18s" WHERE (pis_personel_id = '#385') LIMIT 1
---
  def search_id
    rs = PisJ18.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")