app/controllers/perform_person_now_controller.rb

  def search_edit
    rs = PisPersonel.find(:all,:conditions => "id = #{params[:id]}")
    rs_j18 = PisJ18.find_by_pis_personel_id(rs[0].pis_personel_id)
    return_data = Hash.new()
    return_data[:data]    = rs.collect{|u| {
      :id                => u.id,
      :j18code            => u.j18code,
      :mincode            => u.mincode,
      :deptcode           => u.deptcode,
      :divcode            => u.divcode,
      :sdcode             => u.sdcode,
      :sdname             => (u.sdcode.nil?)? nil:( CodeSdept.find_by_sdcode(  u.sdcode  ).nil? )? nil:CodeSdept.find_by_sdcode(  u.sdcode  ).sdname,
      :subdcode           => u.subdcode,
      :sectcode           => u.sectcode,
      :jobcode            => u.jobcode,
      :birthdate          => u.birthdate,
      :appointdate        => u.appointdate,
      :deptdate           => u.deptdate,
      :retiredate         => u.retiredate,
      :getindate          => u.getindate,
      :exitdate           => u.exitdate,
      :qcode              => u.qcode,
      :macode             => u.macode,
      :codetrade          => u.codetrade,
      :kbk                => u.kbk,
      :cdate              => u.cdate,
      :pis_personel_id    => u.pis_personel_id,
      :note               => u.note,
      :note2              => u.note2,
      :exnamej18         => (rs_j18.nil?)? nil:( CodeExecutive.find_by_excode(   rs_j18.excode   ).nil? )? nil:CodeExecutive.find_by_excode(   rs_j18.excode   ).exname,
---
SELECT * FROM "pis_personels" WHERE (id = 287)
SELECT * FROM "pis_j18s" WHERE ("pis_j18s"."pis_personel_id" = E'#388') LIMIT 1
SELECT * FROM "code_sdepts" WHERE ("code_sdepts"."sdcode" = 3288) LIMIT 1
SELECT * FROM "code_executives" WHERE ("code_executives"."excode" IS NULL) LIMIT 1

  def search_id
    rs = PisPersonel.find(:first,:conditions => "pis_personel_id = '#{params[:pis_personel_id]}'")
---
SELECT * FROM "pis_personels" WHERE (pis_personel_id = '#388') LIMIT 1